---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingRoughness
source: html/9a637452-26db-4061-4df8-01d998d511de.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingRoughness Property

Roughness, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingRoughness { get; }
```